src/tests/load/healthcheck-test.yml
config:
  target: http://localhost:3000
  phases:
    - duration: 30
      arrivalRate: 5
      rampTo: 20
      name: Warm up phase
    - duration: 60
      arrivalRate: 20
      rampTo: 50
      name: Load test
    - duration: 30
      arrivalRate: 10
      rampTo: 5
      name: Cool down phase
  ensure:
    thresholds:
      - http.response_time.p99: 500
      - http.response_time.p95: 300
      - http.errors.rate: 0.01 # Max error rate of 1%
scenarios:
  - name: 'Healtcheck Endpoint Test'
    flow:
      - loop:
          # Simulate various API requests
          - get:
              url: '/healthcheck'
        count: 20 # The entire sequence of requests will repeat 20 times for each virtual user simulated during the test phase.